app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @article = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "HEEY"], ["body", "yes now it does show"], ["created_at", 2016-12-27 13:49:18 UTC], ["updated_at", 2016-12-27 13:49:18 UTC]]
---
  def create
    @article = Article.new(articles_params)
    @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "whoa"], ["updated_at", 2016-12-27 14:43:34 UTC], ["id", 11]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(articles_params)